tgi/cfl.html
---
layout: page
title: Cfl
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Context Free Languages</h2>
<div class="outline-text-2" id="text-1">
<p>
Eine Sprache \(L\) heißt genau dann <i>kontextfrei</i> (engl. context free
language; CFL), wenn es eine CFG \(G\) gibt, die \(L\) erzeugt.
</p>

<p>
Eine Sprache \(L\) heißt genau dann <i>kontextfrei</i> (engl. context free
language; CFL), wenn es einen PDA \(P\) gibt, der \(L\) erkennt.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Abschlusseigenschaften</h3>
<div class="outline-text-3" id="text-1-1">
<p>
CFL sind abgeschlossen bzgl. der Operationenen
</p>

<ul class="org-ul">
<li><b>Vereinigung:</b>
</li>
<li><b>Konkatenation:</b>
</li>
<li><b>Kleene Stern:</b>
</li>
<li>Durchschnittsbildung mit regulären Sprachen, d.h. wenn \(L_0\) CFL und
\(L_1\) RL ist, dann ist \(L_0 \cap L_1\) CFL.
</li>
</ul>
</div>
</div>
</div>
